# Brewfile for macOS Setup
# Install with: brew bundle

# Taps
tap "blacktop/tap"

# Formulae
brew "fish"
brew "lporg"
brew "mas"         # Mac App Store CLI (Required for Xcode/Testflight)

# Browsers
cask "google-chrome"

# Communication
cask "whatsapp"
cask "zoom"
cask "discord"
cask "wechat"
cask "telegram"
cask "signal"

# Editors
cask "sublime-text"

# Terminal
cask "alacritty"

# Window Management
cask "rectangle"

# Security & Privacy
cask "mullvadvpn"
cask "riseup-vpn"
cask "yubico-yubikey-manager"
cask "veracrypt"
cask "cryptomator"
cask "keepassxc"
cask "macpass"

# Development & Design Tools
cask "sf-symbols"
cask "injectioniii"
cask "asset-catalog-tinkerer"
cask "visual-studio-code"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "figma"
cask "ogdesign-eagle"

# Productivity & Knowledge
cask "anki"
cask "netnewswire"
cask "raycast"
cask "zotero"
cask "qbserve"
cask "obsidian"

# Utilities & System Enhancements
cask "appcleaner"
cask "vimac"
cask "meetingbar"
cask "klack"
cask "keyboardcleantool"
cask "hiddenbar"
cask "shottr"

# Recording & Streaming
cask "keycastr"
cask "obs"

# Mac App Store
# Requires you to be logged into the App Store manually first
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664

# Note: Git is included with Xcode Command Line Tools
# Install with: xcode-select --install