# Brewfile - Main applications
# Install with: brew bundle

# Browsers
cask "google-chrome"

# Communication
cask "whatsapp"
cask "zoom"
cask "discord"
cask "wechat"
cask "telegram"
cask "signal"

# Editors
cask "sublime-text"

# Security & Privacy
cask "mullvadvpn"
cask "yubico-yubikey-manager"
cask "veracrypt"
cask "cryptomator"
cask "keepassxc"
cask "macpass"

# Development & Design Tools
cask "sf-symbols"
cask "asset-catalog-tinkerer"
cask "visual-studio-code"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "figma"
cask "ogdesign-eagle"

# Productivity & Knowledge
cask "anki"
cask "netnewswire"
cask "raycast"
cask "zotero"
cask "qbserve"
cask "obsidian"

# Recording & Streaming
cask "obs"

# Manual install
# - Pixelmator Pro, Final Cut related stuff
# - Goodlinks
# - TestFlight, XCode
# - RiseupVPN
