# Brewfile for macOS Setup
# Install with: brew bundle

# Taps
tap "blacktop/tap"
# tap "smudge/smudge"  # Commented out: tap not working for nightlight formula

# Formulae
brew "fish"
brew "lporg"
# brew "nightlight"    # Commented out: formula unreadable, install manually

# Browsers
cask "google-chrome"

# Communication
cask "whatsapp"
cask "zoom"
cask "discord"
cask "wechat"
cask "telegram"
cask "signal"

# Editors
cask "sublime-text"

# Terminal
cask "alacritty"

# Window Management
cask "rectangle"

# Security & Privacy
cask "mullvadvpn"
# cask "riseup-vpn"  # Failed: No cask with this name exists - riseup-vpn is not available in Homebrew Cask
cask "yubico-yubikey-manager"  # Failed: Discontinued upstream on 2025-07-27 - Use manual installation from Yubico website
cask "veracrypt"  # Failed: Download timeout (504 error) - macfuse dependency download failed, try manual installation
cask "cryptomator"  # Failed: Download timeout (504 error) - try manual installation or wait for network stability
cask "keepassxc"
cask "macpass"

# Development & Design Tools
cask "sf-symbols"
# cask "injectioniii"  # Failed: No cask with this name exists - this app is not available in Homebrew Cask
cask "asset-catalog-tinkerer"
cask "visual-studio-code"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "figma"
cask "ogdesign-eagle"

# Productivity & Knowledge
cask "anki"
cask "netnewswire"
cask "raycast"
cask "zotero"
cask "qbserve"
cask "obsidian"

# Utilities & System Enhancements
cask "appcleaner"
# cask "vimac"  # Failed: No cask with this name exists - consider alternatives: vimr, vimcal, or via
cask "meetingbar"
# cask "klack"  # Failed: No cask with this name exists - you might mean 'slack' instead
cask "keyboardcleantool"
cask "hiddenbar"
cask "shottr"

# Recording & Streaming
cask "keycastr"
cask "obs"
cask "cryptomator"



# Manual install
- Pixelmator Pro, Final Cut related stuff
- Goodlinks
- TestFlight, XCode
- RiseupVPN
